---
kind: property
id: P:Autodesk.Revit.DB.IFC.RoofComponents.ScaledDepth
source: html/301309e0-df54-f837-60a0-4d0aaeb9b2a0.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.ScaledDepth Property

The depth of the roof slab.

## Syntax (C#)
```csharp
public double ScaledDepth { get; }
```